runTestCases/initialCases/3_ASJ/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
18080
(
(-0.193997 -3.63943e-23 0.000187377)
(-0.18883 0 0.000190828)
(-0.183572 -1.31973e-22 0.000194676)
(-0.178233 0 0.000198791)
(-0.172826 0 0.000202723)
(-0.167358 0 0.000206113)
(-0.161841 0 0.000208884)
(-0.156286 -8.08131e-23 0.000210988)
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<vector> 
48
(
(-0.3048 2.25769e-21 0.107997)
(-0.3048 -2.39807e-20 0.108101)
(-0.3048 2.25759e-21 0.108209)
(-0.3048 -1.88635e-20 0.108325)
(-0.3048 -3.39943e-20 0.108452)
(-0.3048 -2.78477e-20 0.108595)
(-0.3048 2.85542e-20 0.108756)
(-0.3048 2.49858e-20 0.108942)
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<vector> 
158
(
(-0.298813 7.90763e-19 1.27074)
(-0.287027 2.35513e-19 1.27229)
(-0.275587 2.7911e-19 1.2738)
(-0.26445 5.71827e-19 1.27526)
(-0.253573 0 1.2767)
(-0.242914 0 1.2781)
(-0.232432 3.61207e-20 1.27948)
(-0.222088 3.6121e-20 1.28084)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
48
(
(-0.196571 0 0.000185742)
(-0.196571 -5.39538e-24 0.000478549)
(-0.196571 1.56665e-22 0.000876635)
(-0.196571 2.79592e-23 0.00138478)
(-0.196571 2.90075e-23 0.00202729)
(-0.196572 0 0.00283504)
(-0.196572 -1.20527e-22 0.00384461)
(-0.196572 0 0.00509787)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
112
(
(2.032 0 0.000423776)
(2.032 2.33751e-23 0.000996244)
(2.032 2.80671e-23 0.00163695)
(2.032 0 0.00229866)
(2.032 0 0.00297642)
(2.032 6.236e-22 0.00366914)
(2.032 0 0.00437663)
(2.032 -9.05768e-22 0.00509902)
...
)
;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<vector> 
48
(
(-0.194032 0 0.0761971)
(-0.188843 0 0.0761971)
(-0.183535 0 0.0761971)
(-0.178119 0 0.0761502)
(-0.172613 -2.26445e-21 0.0759121)
(-0.167038 0 0.0753875)
(-0.16142 -1.85373e-20 0.0745871)
(-0.15578 2.27689e-21 0.0735299)
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(-0.298816 0 0.107946)
(-0.287033 0 0.107946)
(-0.275595 0 0.107946)
(-0.264461 0 0.107946)
(-0.253586 0 0.107946)
(-0.242929 0 0.107946)
(-0.23245 0 0.107946)
(-0.222109 0 0.107946)
...
)
;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<vector> 
16
(
(-1.03322e-19 5.64567e-22 0.0254035)
(-3.31666e-19 5.64542e-22 0.0254156)
(-6.0762e-19 0 0.0254302)
(-9.40182e-19 7.31991e-21 0.0254478)
(-1.33962e-18 -5.64433e-22 0.0254689)
(-1.81746e-18 0 0.0254942)
(-2.38633e-18 -5.64327e-22 0.0255243)
(-3.05971e-18 0 0.0255599)
(-3.85143e-18 6.66478e-21 0.0256018)
(-4.77491e-18 5.16141e-21 0.0256507)
(-5.84215e-18 4.96619e-21 0.0257072)
(-7.06242e-18 -5.63936e-22 0.0257717)
(-8.44078e-18 0 0.0258447)
(-9.97645e-18 -5.63759e-22 0.0259259)
(-1.16614e-17 6.37976e-21 0.0260151)
(-1.34796e-17 5.3768e-21 0.0261113)
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
