runTestCases/initialCases/3_ASJ/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
-3.63943e-23
0
-1.31973e-22
0
0
0
0
-8.08131e-23
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
2.25769e-21
-2.39807e-20
2.25759e-21
-1.88635e-20
-3.39943e-20
-2.78477e-20
2.85542e-20
2.49858e-20
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
7.90763e-19
2.35513e-19
2.7911e-19
5.71827e-19
0
0
3.61207e-20
3.6121e-20
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0
-5.39538e-24
1.56665e-22
2.79592e-23
2.90075e-23
0
-1.20527e-22
0
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
0
2.33751e-23
2.80671e-23
0
0
6.236e-22
0
-9.05768e-22
...
)
;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0
0
0
0
-2.26445e-21
0
-1.85373e-20
2.27689e-21
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0
0
0
0
0
0
0
0
...
)
;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
5.64567e-22
5.64542e-22
0
7.31991e-21
-5.64433e-22
0
-5.64327e-22
0
6.66478e-21
5.16141e-21
4.96619e-21
-5.63936e-22
0
-5.63759e-22
6.37976e-21
5.3768e-21
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
