runTestCases/initialCases/3_ASJ/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
0.000187377
0.000190828
0.000194676
0.000198791
0.000202723
0.000206113
0.000208884
0.000210988
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0.107997
0.108101
0.108209
0.108325
0.108452
0.108595
0.108756
0.108942
...
)
;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
158
(
1.27074
1.27229
1.2738
1.27526
1.2767
1.2781
1.27948
1.28084
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0.000185742
0.000478549
0.000876635
0.00138478
0.00202729
0.00283504
0.00384461
0.00509787
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
112
(
0.000423776
0.000996244
0.00163695
0.00229866
0.00297642
0.00366914
0.00437663
0.00509902
...
)
;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
0.0761971
0.0761971
0.0761971
0.0761502
0.0759121
0.0753875
0.0745871
0.0735299
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.107946
0.107946
0.107946
0.107946
0.107946
0.107946
0.107946
0.107946
...
)
;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
0.0254035
0.0254156
0.0254302
0.0254478
0.0254689
0.0254942
0.0255243
0.0255599
0.0256018
0.0256507
0.0257072
0.0257717
0.0258447
0.0259259
0.0260151
0.0261113
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
