runTestCases/initialCases/3_ASJ/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0.064";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
18080
(
(17.711321 6.2116163e-11 -0.00037312181)
(17.81028 6.3467943e-11 -0.0023673591)
(17.988062 -8.1151571e-10 -0.0039794371)
(18.242569 2.4870111e-10 -0.005724372)
(18.584376 1.8956399e-10 -0.0076765337)
(19.02601 1.5202691e-10 -0.0098741729)
(19.579 -1.364923e-09 -0.012333807)
(20.255173 -9.5043557e-10 -0.015067504)
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            freestreamVelocity;
        freestreamValue uniform (3.4396 0 0);
        value           uniform (3.4396 0 0);
    }
    inflow2
    {
        type            freestreamVelocity;
        freestreamValue uniform (3.4396 0 0);
        value           nonuniform List<vector> 
158
(
(3.439784 -6.5658975e-15 -0.0019265614)
(3.4397964 -7.1698112e-15 -0.0033998422)
(3.4398349 -6.9697757e-15 -0.0047643693)
(3.4399018 2.2455023e-14 -0.0061176221)
(3.4399801 1.2237433e-12 -0.0074471685)
(3.4400632 2.3922031e-12 -0.008723814)
(3.4401504 2.372616e-12 -0.0099304154)
(3.4402429 2.3771971e-12 -0.011065958)
...
)
;
    }
    inlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
48
(
(17.711319 0 0.005842056)
(17.71103 0 0.0055280409)
(17.71044 8.5235899e-18 0.0062820182)
(17.709386 -4.2330254e-18 0.0058682934)
(17.707641 0 0.0057542901)
(17.704755 5.2061578e-18 0.005889805)
(17.700051 0 0.005997175)
(17.692536 0 0.0059494801)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            noSlip;
    }
    wall2
    {
        type            noSlip;
    }
    wall3
    {
        type            noSlip;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
