runTestCases/initialCases/3_ASJ/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
0.0011027736
0.0011107357
0.0011233496
0.0011409338
0.0011640729
0.00119344
0.0012297167
0.0012736268
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      uniform 1.156e-5;
        value           uniform 1.156e-5;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      uniform 1.156e-5;
        value           uniform 1.156e-5;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1.156e-5;
        value           uniform 1.156e-5;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
48
(
0.036802643
0.0071673738
0.0031268041
0.0013758833
0.0011816736
0.0020565127
0.0031555033
0.0043961143
...
)
;
    }
    wall2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
30
(
0.01462228
0.0024878066
0.0011567128
0.00083761963
0.00068897922
0.00061077667
0.00057318499
0.00056865689
...
)
;
    }
    wall3
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
16
(
153.30008
105.84336
52.453333
20.221752
7.5633503
3.5354997
2.1490863
1.4154088
0.9104249
0.54043257
0.29458768
0.15675726
0.10014885
0.084134297
0.079809359
0.077415739
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
