runTestCases/initialCases/3_ASJ/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
0.1721161
0.47315077
0.73912167
1.0126762
1.3118178
1.6440858
2.014657
2.4231382
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      uniform 335;
        value           uniform 335;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      uniform 335;
        value           uniform 335;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 335;
        value           uniform 335;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall1
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
48
(
32096711
30987934
29813051
28630840
27668059
27018443
26642739
26507467
...
)
;
    }
    wall2
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
30
(
467189.86
466346.82
465610.08
464900.68
464209.43
463532.63
462866.86
462209.8
...
)
;
    }
    wall3
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
16
(
68830.516
57524.181
40709.606
25422.122
15675.735
10843.21
8563.8544
7059.6352
5790.1534
4644.1402
3687.8545
3021.0418
2700.2195
2603.1164
2576.9239
2562.398
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
