runTestCases/initialCases/3_ASJ/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.064";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
18080
(
121033.62
121032.25
121028.74
121023.4
121015.91
121005.8
120992.59
120975.72
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inflow1
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
        value           nonuniform List<scalar> 
48
(
101321.69
101321.69
101321.68
101321.68
101321.67
101321.66
101321.66
101321.65
...
)
;
    }
    inflow2
    {
        type            freestreamPressure;
        freestreamValue uniform 101325;
        value           nonuniform List<scalar> 
158
(
101323.96
101323.96
101323.96
101323.96
101323.96
101323.97
101323.97
101323.97
...
)
;
    }
    inlet
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 121257;
        value           nonuniform List<scalar> 
48
(
121032.9
121032.91
121032.92
121032.95
121032.99
121033.07
121033.18
121033.37
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    wall3
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
